{
  "pdf_path": "/Users/uba/Documents/Advisor-Matcher-CV/S3Bucket/cv-1750602585457.pdf",
  "sections": {
    "summary": "SUMMARY\nMachine Learning Engineer with 1+ year experience and proficiency in training and building learning models using\nPyTorch and Tensorflow, also some exposure to software development.\n",
    "experience": "EXPERIENCE\nAl Fellowship: Fusemachines | April 2024 - September 2024\nEngineered an industry-grade Computer Vision and AI for Governance project using state-of-the-art models.\nHands-on experience in the Machine Learning project lifecycle.\nGrouped with colleagues and mentors to solve real-world challenges and data shifts when deployed in real life.\nEngaged in sentiment analysis, text classification, and other NLP assignments.\nResearch paper reading sessions of the latest AI technologies and their implementation.\nIntensive training on Supervised and Unsupervised Deep Learning and Deep Generative models.\nExperienced at working with Agile Principles to develop an AI-Powered Expense Tracker web app.\nIntegrated a chatbot responsible for providing suggestions to the user regarding his spending patterns.\nCreated RESTful APIs using FastAPI for user authentication, expense tracking, and real-time analytics.\nLink] Medical Chatbot\nDeveloped a RAG-based medical chatbot to address the issue of retrieving accurate and reliable medical\ninformation.\nSolved the issue of LLMs getting very large input (e.g., an entire medical book) at once for one query by a user.\nIntegrated SOTA LLM, Llama 3.1, with Pinecone vector database using Langchain for the exact needed context to\nthe model.\nDeployed the chatbot locally using Flask and HTML, and CSS for a user-friendly web interface.\nLink] Resume Sense: AI-Powered ATS Resume Analyzer\nResolved the issue of manual scanning of resumes by recruiters with the help of LLMs to check how well the user\nfits the job description.\nUsed Ollama with an open source model, Mistral, to analyze resumes offline and provided a Percentage match\nscore, strengths, and missing skills of the candidate to the position details, and Streamlit for the UI development.\nLink] Potato Disease Classification\nDeveloped a CNN-based classification system using Tensorflow to identify disease by providing a leaf image.\n--- Page 2 ---\ne Applied preprocessing techniques such as data augmentation and image normalization, along with weight decay,\nto handle the overfitting. Used Streamlit to make the frontend for the system, where the user uploaded images.\n",
    "projects": "PROJECTS\nLink] Document Verification System\nSolved the issue of document fraud by allowing organizations to verify a person’s government documents.\nThe system used ResNet50 for document classification, YOLOv8 for details localization, and EasyOCR to extract\ndetails alongside Regex and Natural Language Processing to clean the text to verify the entry from the database,\nresulting in a genuine or fraudulent document as output.\nUsed Streamlit for the user interface to call the model's pipeline.\nManaged to get an overall accuracy/success rate of 82%.\nLink] AarthikNiti - Expense Tracker\nWorked as a Machine Learning Engineer, Lead Backend Developer and Project Manager.\n",
    "skills": "TECHNICAL SKILLS\n",
    "education": "EDUCATION\nHerald College, Kathmandu | B.(Hons) in Computer Science | 2023 - 2026\nCapital College and Research Center, Kathmandu | 10 + 2 | 2020 - 2022\n",
    "certifications": "CERTIFICATIONS\n[Link] Microdegree™ in Artificial Intelligence | Fusemachines\n[Link] Machine Learning Specialization | DeepLearning.AI\n[Link] Python 3 Programming Specialization | University of Michigan\n",
    "languages": "Languages: Python, Java, C\nFrameworks: PyTorch, Tensorflow, FastApi, Flask, MLflow\nTools: Git, Docker, DVC, MySQL, Jira, Amazon EC2\nEXTRACURRICULAR ACTIVITIES\ne Community Leader at AI Learners Community, Herald College Kathmandu, where I conducted workshop\nsessions on Data Analysis, Machine Learning, and Generative AI in collaboration with Fusemachines and\norganized FYP demonstration projects of passed-out seniors of different IT domains showcasing to the first-year\nstudents.\ne Written blog posts on medium based on experience and new AI technologies.\nLANGUAGES\nNepali (Native), English (Working proficiency), Hindi (Working proficiency)\n",
    "others": "--- Page 1 ---\nRahul Dev Banjara\n+977 9866121812 | rdbanjara07@gmail.com | LinkedIn | GitHub | Portfolio\n"
  }
}